
&НаКлиенте
Процедура РолиРольПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Роли.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьСтрокуПоРолиНаСервере(ТекущиеДанные.Роль, ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры         

&НаСервере
Процедура ЗаполнитьСтрокуПоРолиНаСервере(РольСсылка, ИдентификаторСтроки)
    
    Если НЕ ЗначениеЗаполнено(РольСсылка) Тогда
        Возврат;
    КонецЕсли;
    
    СтрокаТЧ = Объект.Роли.НайтиПоИдентификатору(ИдентификаторСтроки);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    РолиВБазах.ИнформационнаяБаза,
    |    РолиВБазах.Активна,
    |    РолиВБазах.Описание
    |ИЗ
    |    Справочник.РолиВБазах КАК РолиВБазах
    |ГДЕ
    |    РолиВБазах.Ссылка = &Роль";
    
    Запрос.УстановитьПараметр("Роль", РольСсылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        СтрокаТЧ.ИнформационнаяБаза = Выборка.ИнформационнаяБаза;
        СтрокаТЧ.Активна            = Выборка.Активна;
    КонецЕсли;
    
КонецПроцедуры