
&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьДоступностьПолей()

    ЗначениеБлокировки = Объект.Недействителен;

   
    Для Каждого Элемент Из Элементы Цикл
        
        Если Элемент.Имя = "Недействителен" Тогда
            Продолжить;
        КонецЕсли;
        
        Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
            Продолжить;
        КонецЕсли;
        
        Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
            Продолжить;
        КонецЕсли;
        
       
        Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
            Если Элемент.Вид = ВидПоляФормы.ПолеВвода
               Или Элемент.Вид = ВидПоляФормы.ПолеФлажка
               Или Элемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
                
                Элемент.ТолькоПросмотр = ЗначениеБлокировки;
            КонецЕсли;
        КонецЕсли;
        
        
        
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПолей();
КонецПроцедуры


