
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ТекущиеДанные = Объект; 
    
    Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
        
        НаименованиеСотрудника = ПолучитьНаименованиеСотрудника(Объект.Сотрудник);
        
        Если ЗначениеЗаполнено(НаименованиеСотрудника) Тогда
            Объект.Наименование = НаименованиеСотрудника;
        КонецЕсли;
        
    Иначе
        Объект.Наименование = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСотрудника(СотрудникСсылка)
    
    Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
        Возврат "";
    КонецЕсли;
    
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "Наименование");
    
КонецФункции      


&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
    Элементы.ДатаОтмены.Видимость = Объект.Недействителен;
	
	Если Объект.Недействителен Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОтмены) Тогда
			Объект.ДатаОтмены = ДатаСеанса(); 
		КонецЕсли;
	Иначе
		Объект.ДатаОтмены = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
