
&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ИнформационнаяБаза", Объект.Ссылка);
	ОткрытьФорму("Обработка.ЗагрузкаПользователейИзБазы1С.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипБазыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипБазы = Перечисления.ТипыИнформационныхБаз.Серверный;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	Если Объект.ТипБазы = Перечисления.ТипыИнформационныхБаз.Серверный Тогда
		Элементы.ПутьКБазе.Заголовок = "Имя базы на сервере 1С";
	Иначе
		Элементы.ПутьКБазе.Заголовок = "Путь к базе на файловом сервере";
	КонецЕсли;
КонецПроцедуры
