Функция ПреобразоватьСтруктуруВСотрудника(СтруктураДанные)Экспорт
	
	СтруктураДанные = Новый Структура();
	Если НЕ СтруктураДанные.Свойство("emloyeeID") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	искСотрудник = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанные.emloyeeID));
	
	Если искСотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		СотрудникОбъект = Справочники.Сотрудники.СоздатьЭлемент();  
	Иначе	
		СотрудникОбъект = искСотрудник.ПолучитьОбъект();
	КонецЕсли;
	
	Для каждого элСтруктуры ИЗ СтруктураДанные Цикл
		Если элСтруктуры.Ключ = "emloyeeID" Тогда
			Продолжить;
		КонецЕсли;	
		
		
		
	КонецЦикла;	

КонецФункции