
Функция personadd(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);  
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Запрос);
	
	СтруктураСотрудника = ПрочитатьJSON(ЧтениеJSON);
	
	Отказ = Ложь; 
	СообщениеОбОшибке = "";
	СотрудникСсылка			= Справочники.Сотрудники.ПреобразоватьСтруктуруВСотрудника(СтруктураСотрудника, Отказ, СообщениеОбОшибке);
	
	Если Отказ Тогда
		стрОтвета = Новый Структура();
		стрОтвета.Вставить("Error", СообщениеОбОшибке);
		
		Ответ.УстановитьТелоИзСтроки(ДанныеJSON(стрОтвета));
	КонецЕсли;
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;
КонецФункции

Функция personpriem(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
