&НаКлиенте
Процедура СформироватьФИО()
    Объект.Наименование = СокрЛП(Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        СформироватьФИО();
    КонецЕсли;
    
    УправлениеВидимостьюДоступностью();
   КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура УволенПриИзменении(Элемент)
    УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ДатаУвольненияПриИзменении(Элемент)
   Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
		Объект.Уволен = Ложь;
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
    Элементы.ДатаУвольнения.Видимость = Объект.Уволен;
	
	Если Объект.Уволен Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
			Объект.ДатаУвольнения = ДатаСеанса(); 
		КонецЕсли;
	Иначе
		Объект.ДатаУвольнения = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции