&НаКлиенте
Процедура СформироватьФИО()
    Объект.Наименование = СокрЛП(Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        СформироватьФИО();
    КонецЕсли;
    
    УправлениеВидимостьюДоступностью();
   КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
    СформироватьФИО();
КонецПроцедуры

&НаКлиенте
Процедура УволенПриИзменении(Элемент)
    УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ДатаУвольненияПриИзменении(Элемент)
   Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
		Объект.Уволен = Ложь;
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
    Элементы.ДатаУвольнения.Видимость = Объект.Уволен;
	
	Если Объект.Уволен Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) Тогда
			Объект.ДатаУвольнения = ДатаСеанса(); 
		КонецЕсли;
	Иначе
		Объект.ДатаУвольнения = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Возврат;
    КонецЕсли;
    
    ОбновитьТаблицуДоступов();
КонецПроцедуры       


&НаСервере
Процедура ОбновитьТаблицуДоступов()

    ДоступыСотрудника.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ДоступыСотрудников.Период                     КАК Период,
    |    ДоступыСотрудников.ИнформационнаяБаза           КАК ИнформационнаяБаза,
    |    ДоступыСотрудников.ИнформационнаяБаза.Наименование КАК ИнформационнаяБазаНаименование,
    |    ДоступыСотрудников.Роль                          КАК Роль,
    |    ДоступыСотрудников.ДоступРазрешен                КАК ДоступРазрешен,
    |    ДоступыСотрудников.ДатаНазначения                КАК ДатаНазначения,
    |    ДоступыСотрудников.ЗаблокированВручную           КАК ЗаблокированВручную,
    |    ДоступыСотрудников.ПричинаИзменения              КАК ПричинаИзменения
    |ИЗ
    |    РегистрСведений.ДоступыСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ДоступыСотрудников
    |УПОРЯДОЧИТЬ ПО
    |    Период УБЫВ";

    Запрос.УстановитьПараметр("Сотрудник", Объект.Ссылка);

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        Стр = ДоступыСотрудника.Добавить();
        ЗаполнитьЗначенияСвойств(Стр, Выборка);
    КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьТаблицуДоступов();
КонецПроцедуры



